In [23]:
import pandas as pd
import numpy as np

# MSFT Dataset

In [52]:
with open('drive/My Drive/MSFT_data.csv', 'r') as fin:
    data = fin.read().splitlines(True)
with open('drive/My Drive/MSFT_data_new.csv', 'w') as fout:
    fout.writelines(data[14:])

In [53]:
filepath = "drive/My Drive/MSFT_data_new.csv"

data = pd.read_csv(filepath)

In [54]:
data.head()

         date    open    high     low   close      volume
0  1986-03-13  0.0577  0.0662  0.0577  0.0633  1031788800
1  1986-03-14  0.0633  0.0667  0.0633  0.0656   308160000
2  1986-03-17  0.0656  0.0673  0.0656  0.0667   133171200
3  1986-03-18  0.0667  0.0673  0.0645  0.0650    67766400
4  1986-03-19  0.0650  0.0656  0.0633  0.0639    47894400

In [56]:
for col in data:
    col_np = data[col].to_numpy()
    print(col, type(col_np[0]))

date <class 'str'>
open <class 'numpy.float64'>
high <class 'numpy.float64'>
low <class 'numpy.float64'>
close <class 'numpy.float64'>
volume <class 'numpy.int64'>

# Amphibians Dataset

In [57]:
with open('drive/My Drive/Amphibians.csv', 'r') as fin:
    data = fin.read().splitlines(True)

    j = 0
    for line in data:
        i = 0
        for char in line: 
            if char == ';':
               line = line[:i] + ',' + line[i+1:]

            i+=1

        data[j] = line
        j+=1

with open('drive/My Drive/Amphibians_new.csv', 'w') as fout:
    fout.writelines(data[1:])

In [58]:
filepath_2 = "drive/My Drive/Amphibians_new.csv"

data_2 = pd.read_csv(filepath_2)

In [59]:
data_2.head()

   ID Motorway   SR  ...  Tree frog  Common newt  Great crested newt
0   1       A1  600  ...          0            0                   0
1   2       A1  700  ...          0            1                   0
2   3       A1  200  ...          0            1                   0
3   4       A1  300  ...          0            0                   0
4   5       A1  600  ...          0            1                   1

[5 rows x 23 columns]

In [62]:
for col in data_2:
    col_np = data_2[col].to_numpy()
    print(col, type(col_np[0]))

ID <class 'numpy.int64'>
Motorway <class 'str'>
SR <class 'numpy.int64'>
NR <class 'numpy.int64'>
TR <class 'numpy.int64'>
VR <class 'numpy.int64'>
SUR1 <class 'numpy.int64'>
SUR2 <class 'numpy.int64'>
SUR3 <class 'numpy.int64'>
UR <class 'numpy.int64'>
FR <class 'numpy.int64'>
OR <class 'numpy.int64'>
RR <class 'numpy.int64'>
BR <class 'numpy.int64'>
MR <class 'numpy.int64'>
CR <class 'numpy.int64'>
Green frogs <class 'numpy.int64'>
Brown frogs <class 'numpy.int64'>
Common toad <class 'numpy.int64'>
Fire-bellied toad <class 'numpy.int64'>
Tree frog <class 'numpy.int64'>
Common newt <class 'numpy.int64'>
Great crested newt <class 'numpy.int64'>

# HMIS Operation Dataset

In [63]:
filepath_3 = "drive/My Drive/HMIS_Anaesthesia.csv"

data_3 = pd.read_csv(filepath_3)

In [64]:
data_3.head()

     District  ... No. of facilities by performance - >300
0  Alipurduar  ...                                       0
1  Alipurduar  ...                                       0
2     Bankura  ...                                       2
3     Bankura  ...                                       2
4     Birbhum  ...                                       2

[5 rows x 11 columns]

In [65]:
for col in data_3:
    col_np = data_3[col]
    print(col, type(col_np[0]))

District <class 'str'>
Facility Type <class 'str'>
Total No. of Facilities # <class 'numpy.int64'>
No. of facilities reporting nil performance * <class 'numpy.int64'>
Performance - Overall Average ** <class 'numpy.int64'>
Performance - Maximum <class 'numpy.int64'>
Performance - Minimum <class 'numpy.int64'>
No. of facilities by performance - 1 to 30 <class 'numpy.int64'>
No. of facilities by performance - 31 to 150 <class 'numpy.int64'>
No. of facilities by performance - 151 to 300 <class 'numpy.int64'>
No. of facilities by performance - >300 <class 'numpy.int64'>